[{"id": 2420, "gempId": "6_43", "side": "Light", "rarity": "R", "set": "6", "printings": [{"set": "6"}], "front": {"title": "•Tanus Spijek", "imageUrl": "https://res.starwarsccg.org/cards/JabbasPalace-Light/large/tanusspijek.gif", "type": "Character", "subType": "Alien", "uniqueness": "*", "destiny": "2", "power": "2", "ability": "1", "deploy": "3", "forfeit": "3", "characteristics": ["spy"], "gametext": "When at a Yavin 4 site, adds 1 to your Force drains at Alderaan system for each Yavin 4 site you control. While at Audience Chamber, all your other Elom are power and forfeit +1.", "lore": "Male Elom. Former spy for the Rebellion. Hired by the Alliance to carry messages between Alderaan and the Rebel base on Yavin 4."}, "pulledBy": ["Soth Petikkin (when at a Jabba's Palace site you control)"], "counterpart": "J'Quille", "combo": ["Tanus Spijek + Double Agent", "Our Most Desperate Hour + Tatooine System + 3+ Ability Characters Since you're already playing the Alderaan system, why not use it to your advantage. Captain Han in the Falcon works well in pulling this one off, plus you can avoid all the nasty stuff down below by remaining in space and on Yavin 4. One of the easiest ways to retrieve Force.  Death Star Docking Bay + Death Star Trash Compactor + Death Star Plans + A Droid Fairly simple to pull off since you're playing all the Yavin 4 sites. Simple cards like Tunnel Vision or Hiding In The Garbage will help you get those Death Star sites.  Kessel System + Kessel Run + A Smuggler OK, I like to retrieve Force. A Force drain for three may be easier than usual because many Dark players are focused on capturing at sites with Bounty Hunters. Deploy another ship to the Alderaan system where Captain Han is hovering in the Falcon and send him to Kessel.  Effective Repairs + Utinni Effects Not only does it cancel the annoying Limited Resources, but this card also allows you to retrieve any Utinni Effect into your hand, which is what all those precious Force retrieval cards just happen to be.  Tanus Spijek doesn't actually play much of a part in the Force retrieval, but after reading his card I came up with all of this. The few card which his game text makes essential for a deck around him is so nicely complimented by the Force retrieval opportunities. This deck has already won a couple times for me and is a lot of fun to play. Your opponent begins to become angry the third or fourth time you've successfully retrieved your entire Lost Pile! If you're still worried about Dark Side spies popping up or other ways for the Dark player to infiltrate Yavin 4, a card like Houjix is excellent in case you get totally taken by surprise and majorly overpowered in a battle, but the deck is character-heavy and those high destinies on the Force retrieval cards will serve you well in firing weapons and battle destinies."], "legacy": false}]